Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་ཐོས་པ་དེ་བཞིན་མཐོང་། །དེ་བས་ཀྱང་ནི་ལྷག་པར་བཟང་། །
en: “ ‘Now I see what I had heard about, Yet what I see is even more magnificent!

source: འཇིག་རྟེན་དག་ན་ཁྱོད་དང་ནི། །ཡེ་ཤེས་ཡོན་ཏན་འདྲ་མ་མཆིས། །
en: In this world there is nothing Like you and your qualities of wisdom.’

source: དེ་ལ་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེས་སླར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: “The thus-gone Unfathomable Light Rays replied:

source: ཁྱིམ་བདག་ཁྱོད་ཀྱིས་ཚིག་སྨྲས་པ། །དབེན་པར་འགྱུར་བ་ཡིན་ཏེ་ལེགས། །
en: “ ‘Householder, what you speak Are words of disengagement—excellent!

source: ཇི་ལྟར་འདིར་ནི་ཡུན་རིང་དུ། །དགེ་བའི་རྩ་བ་ཤིན་ཏུ་བསྟེན། །
en: For long have you been practicing The cultivation of roots of virtue.

source: འཇིག་རྟེན་དག་ན་ང་འདྲ་མེད། །
en: “ ‘There is no one like me in the world;

source: ང་ལས་ལྷག་འགྱུར་ག་ལ་ཡོད། །
en: How could I have any superior?

source: ཁྱིམ་བདག་ཅུང་ཟད་ཡིད་ལ་ནི། །ཞུ་བ་གང་དག་འདོད་པ་ཞུས། །
en: Householder, now you should put forward Even the slightest question that may be on your mind.

source: དེས་པ་ཁྱོད་ཀྱི་འདོད་པ་གང་། །ང་ཡིས་ཁྱོད་ཀྱི་སེམས་རངས་བྱ། །
en: “ ‘Noble man, I shall ensure that your mind Will be completely satisfied.

source: ང་ལ་ཅུང་ཟད་གང་འདྲི་བ། །དེ་རིང་ཐེ་ཙོམ་མེད་པར་བྱ། །
en: Whatever issue you bring to me, I shall settle it today beyond all doubt.’

source: དེ་ནས་ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: “Then the householder Wishing for Disengagement, who was like a great sal tree, offered the following verses to the Thus-Gone One:

source: ཇི་ལྟར་བསམ་གཏན་ལངས་ནས་མཆིས། །
en: “ ‘How does one arise from concentration,

source: བསམ་གཏན་བསམ་གཏན་ཡོན་ཏན་དགའ། །འདི་ལ་ཡིད་གཞོལ་ཇི་ལྟར་འགྱུར། །
en: And how should one apply one’s mind To concentration and its delightful qualities?

source: ཞུས་པ་དེ་དག་བདག་ལ་གསུངས། །
en: Please answer these questions for me.

source: དགེ་བའི་རྩ་བ་གང་གིས་ནི། །ཤེས་པ་དེ་ནི་རྟོགས་པར་འགྱུར། །
en: “ ‘Which roots of virtue will bring Understanding of such knowledge?

source: ལྡན་པ་དང་ནི་ཤེས་པའི་རྒྱུ། །
en: What are the causes for understanding their acquisition?

source: དེ་ལ་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེས་ལུང་བསྟན་པ་ཚིགས་སུ་བཅད་པ་གཅིག་གིས་ཡོངས་སུ་མགུ་བར་མཛད་དེ།
en: “In response the thus-gone Unfathomable Light Rays delivered a single, satisfying teaching in verse:

source: མཚན་མེད་བྱས་པའི་བསམ་གཏན་ནི། །ལྡང་བ་ལ་ཡང་ཤིན་ཏུ་ངེས། །
en: “ ‘For concentration without marks Emergence is utterly certain.

source: ཤེས་པ་གང་གིས་བསམ་གཏན་དེ། །སོ་སོར་ཐོབ་ནས་རབ་ཏུ་ཤེས། །
en: The mind that achieves concentration Will comprehend this as it is achieved.’

source: ཞུ་བ་ལུང་བསྟན་ཐོས་ནས་སུ། །འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ཡིས། །ཁྱིམ་བདག་དཔའ་བོ་མཁས་པ་ནི། །སྐྱེ་བ་མེད་ལ་རབ་ཏུ་བཞག །
en: “Having heard this teaching in reply to his questions, The wise and heroic householder Was established within the unborn state By the protector and savior of the world.

source: དེ་ནི་སངས་རྒྱས་ཆོས་དག་ལ། །སོམ་ཉི་ཐེ་ཙོམ་མེད་པར་གནས། །
en: “And so he remained, free of doubt and hesitation About the qualities of the buddhas.

source: འཁོར་དེ་སྣང་བར་བྱས་ནས་སུ། །འདྲེན་པ་ལ་ནི་འདི་སྐད་གསོལ། །
en: Having illumined the retinue, He asked the guide:

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་གསུང་དག །
en: “ ‘How are the words of the blessed ones To be understood?’

source: ཇི་ལྟར་རྣམ་པར་འཚལ་བར་འགྱུར། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དཔག་མེད་དེས་ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: “In reply, the thus-gone Unfathomable Light Rays spoke this verse to the householder Wishing for Disengagement, who was like a great sal tree:

source: གང་གཱའི་བྱེ་སྙེད་སེམས་ཅན་དག །ང་ཡིས་ལེགས་བཤད་ཐོས་ནས་སུ། །ཡང་དག་པ་ནི་ཇི་བཞིན་ཤེས། །སྐྱེ་བ་མེད་ལ་རབ་ཏུ་བཀོད། །
en: “ ‘As many sentient beings as there are sand grains in the Ganges Hear my instructions, Understand reality, just as it is, And are thus established within the unborn.’

source: ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time Wishing for Disengagement, who was like a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་དབེན་པ་འདོད་པ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days I was the householder Wishing for Disengagement, who was like a great sal tree,

source: འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་ཞུ་བ་ཡོངས་སུ་ཞུས་སོ། །
en: and I asked those questions for the benefit of all beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་འདོད་པས་བསམ་གཏན་ལ་མཁས་པར་བྱ།
en: Thus, Maudgalyāyana, those bodhisattva great beings who wish to benefit all beings should become expert in concentration.

source: བསམ་གཏན་གྱི་ལྡང་བ་ལ་མཁས་པར་བྱ།
en: They should become expert in emerging from concentration.

source: ལྡང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པའི་དགེ་བའི་རྩ་བ་གང་ཡང་དག་པར་འདུ་བར་འགྱུར་བའི་དགེ་བའི་རྩ་བ་དེ་དག་ཤིན་ཏུ་གཞག་པར་བྱ། ཤིན་ཏུ་གཟུང་བར་བྱ།
en: They should carefully strengthen the roots of virtue associated with knowledge of the origin as related to the knowledge of emergence.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་གནས་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of abiding. I did this by realizing knowledge of the cessation of peaceful liberation and then wondering how to teach this genuinely to sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དགྲ་ངེས་པར་བཅོམ་པ་ཞེས་བྱ་བ་འབའ་ཞིག་ཁོ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ལ་རྒྱལ་སྲིད་བྱེད་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a king known as Conquest of the Enemy who ruled exclusively in a buddha realm.

source: རྒྱལ་པོ་དགྲ་ངེས་པར་བཅོམ་པ་དེ་དང་ཉེ་བ་ཞིག་ན། དེ་བཞིན་གཤེགས་པ་བདེ་མཛད་ཅེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: In his vicinity resided the thus-gone Kṣemaṅkara, surrounded by a retinue of innumerable thousands of hearers and innumerable thousands of bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་བདེ་མཛད་དེའི་འཁོར་ཉན་ཐོས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་། །
en: [In his vicinity resided the thus-gone Kṣemaṅkara,] surrounded by a retinue of innumerable thousands of hearers and innumerable thousands of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ནང་དུ་བྱང་ཆུབ་སེམས་དཔའ་མོས་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་བྱུང་ངོ་། །
en: Among the bodhisattvas there was one named Endowed with the Power of Inspiration.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དག་ཐེག་པ་གསུམ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པར་གྱུར་ཏེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པའོ། །
en: “At that time the beings of that buddha realm belonged to the three vehicles of the hearers, the solitary buddhas, and the buddhas.

source: སེམས་ཅན་གང་དག་སངས་རྒྱས་ཀྱི་ཐེག་པ་འདི་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་དེས་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པའི་སེམས་ཅན་དེ་དག་ཡང་དང་ཡང་དུ་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སྤྲོ་བ་རབ་ཏུ་སྐྱེད་པར་བྱེད་དེགྲོགས་པོ་དག་ཐེག་པ་ཆེན་པོ་ནི་དགའ་བར་བྱ་བ་ཡིན་ཏེ།
en: Those dwelling within this vehicle of the buddhas would again and again try to make those of the Hearer Vehicle become fond of the vehicle of the buddhas, telling them, ‘Friends, the Great Vehicle is a joyous one.

source: གང་ལ་མི་ཤེས་པའམ་མ་མཐོང་བའམ། མ་རིག་པའམ་མངོན་སུམ་དུ་མ་བྱས་པའམ།
en: There is nothing that is not known, seen, recognized, or perceived.

source: ཉེ་བར་སྐྱེ་བའམ། ཉེ་བར་འདུག་པའམ་འགགས་པ་གང་ཡང་མེད་དོ། །
en: There is nothing that arises, remains, or ceases.’

source: དེ་ལ་གང་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་སེམས་ཅན་དེ་དག་ཡོངས་སུ་མི་དགའ་བའི་བློ་སྐྱེས་ཏེ།
en: “The beings of the Hearer Vehicle would respond to this with irritation, saying,

source: འཁོར་བར་ཤིན་ཏུ་རྒྱུག་པའི་སེམས་ཅན་སྔོན་གྱི་མཐའ་མི་ཤེས་པའི་འགྲོ་བ་འདི་དག་ལ་རེ་ཞིག་སུ་ཞིག་སྤྲོ་བར་འགྱུར་སྙམ་ནས་
en: ‘Who could ever feel happy with beings who race around in cyclic existence without any knowledge of the past?’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པའི་སེམས་ཅན་དེ་དག་དང་ཆོས་འཐུན་པས་རྩོད་པར་བྱེད་དེ
en: They would therefore enter into religious debates with those abiding in the Bodhisattva Vehicle, telling them,

source: ཀྱེ་མ་ཚེ་དང་ལྡན་པ་ཁྱེད་ཅག་ཅི་སྔོན་ཡུན་རིང་པོ་ནས་སྡུག་བསྔལ་དང་སྡུག་བསྔལ་ཤིན་ཏུ་བསྐྱེད་པ་འདི་ཤེས་སམ།
en: ‘Alas, venerable ones, are you aware that you have been creating suffering again and again for so long?’

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་དག་མ་ཡིན་ནོ། །
en: “ ‘No, venerable ones,’ the reply would sound.

source: སྨྲས་པ་ཁྱེད་ཅག་ལ་གང་གི་ཚེ་ཡོངས་སུ་བཟུང་བ་དང་བཅས་པ་རྙེད་པ་དེའི་ཚེ་ཁྱེད་ཅག་འཇིགས་སམ། ཁྱེད་ཅག་སྤྲོ་བ་ཆེན་པོ་མ་བྱས་པ་ལ་རྟོག་ལ་བྱས་པ་ལ་ནི་མི་རྟོག །
en: “Again the hearers would ask, ‘Well, have you been afraid at those times when you have made gains while apprehending? Or have you been overjoyed, thinking about what you have not done rather than thinking of what you have done?

source: ཚེ་དང་ལྡན་པ་དག་བྱས་པ་བཏང་ནས་མ་བྱས་པ་ལ་རྟོག་པ་དེ་ནི་འཇིགས་པར་འགྱུར།
en: Venerable ones, if you forget what you have done, and instead think of what you have not done, you will end up in danger.

source: གང་ཞིག་བྱས་པ་ལ་རྟོག་ཅིང་མ་བྱས་པ་ལ་མ་ཡིན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་མང་དུ་བྱས་སོ། །དེ་བྱས་པ་རྟོགས་པ་དེ་ནི་འཇིགས་པ་མེད་དོ། །
en: On the other hand, those who keep track of what they have done, and not of what they have not done, will be free from danger as they keep in mind the many things that they have done.’

source: ཚེ་དང་ལྡན་པ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་ཅག་གིས་འདི་ལྟར་ཤེས་ཏེ། བྱས་པ་བྱས་པ་ལ་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: “ ‘Venerable ones,’ replied the bodhisattvas, ‘we understand the teaching of the Blessed One to be telling us to examine what “done” means.

source: བྱས་པ་བྱས་པ་ལ་གང་ཡོངས་སུ་རྟོག་པ་དེ་ནི་བདག་གིས་མང་དུ་བྱས་སོ་ཞེས་མི་ཤེས་སོ། །
en: And if you do that, you will not be thinking, “I have done many things.”

source: ཚེ་དང་ལྡན་པ་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་དྲང་སྲོང་རྟ་དམར་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: Venerable ones, once in the past there was a sage by the name of Red Horse.

source: དེ་འདི་སྙམ་དུ་སེམས་སོ། །འཇིག་རྟེན་གྱི་མཐར་སོང་ནས་ཕྱིས་འཆི་བའི་དུས་བྱའོ་སྙམ་ནས་དེ་འཇིག་རྟེན་གྱི་མཐར་འགྲོ་བར་ཆས་སོ། །
en: This sage set out on a journey thinking, “I shall travel to the end of the world before I die.”

source: དེའི་གོམ་པ་འདི་ལྟ་བུར་འདོར་ཏེ་རི་རབ་ཀྱི་རྩེ་མོ་གཅིག་ནས་རི་རབ་ཀྱི་རྩེ་མོ་གཞན་ལ་གོམ་པ་འདོར་རོ། །
en: When the sage walked, he stepped from one Sumeru mountaintop to another,

source: མགྱོགས་པ་དེ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན་རྫུ་འཕྲུལ་གྱི་སེམས་ཀྱིས་འགྲོ་བ་བཞིན་ནོ། །
en: traveling with great speed, as when one travels miraculously through mental powers .

source: དེ་འཇིག་རྟེན་གྱི་མཐར་མ་སོན་པར་འཆི་བའི་དུས་བྱས་སོ། །
en: Yet still he died before reaching the end of the world.

source: ཚེ་དང་ལྡན་པ་དག་རྐང་པས་འཇིག་རྟེན་གྱི་མཐར་འགྲོའོ་ཞེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མི་གསུང་སྟེ།
en: Venerable ones, the Blessed Buddha does not tell us to reach the end of the world on foot.

source: ཡེ་ཤེས་ཀྱིས་འཇིག་རྟེན་གྱི་མཐར་འགྲོའོ། །
en: Rather, it is due to wisdom that one reaches the end of the world.

source: ཚེ་དང་ལྡན་པ་ཁྱེད་གང་སྡུག་བསྔལ་དང་སྡུག་བསྔལ་ལ་ཡང་དག་པར་ཤེས་པ་དེ་ཁྱེད་ཀྱིས་མ་འོངས་པ་ཡོངས་སུ་རྟོག་ན་སྡུག་བསྔལ་དང་སྡུག་བསྔལ་གྱི་འདུ་ཤེས་སུ་འགྱུར་རོ། །
en: Venerable ones, if you stay concerned about suffering then you will also be conceiving of suffering in the future.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སྲེད་པ་ཟད་པའི་མཐར་འགྲོ་བར་བྱེད་ཀྱི་འཇིག་རྟེན་གྱི་མཐའ་འདོགས་པར་ནི་མི་བྱེད་དེ།
en: Bodhisattva great beings journey to the end of the exhaustion of craving. They do not think about reaching the end of the world.

source: དེ་དག་ལ་སྡུག་བསྔལ་དང་སྡུག་བསྔལ་གྱི་འདུ་ཤེས་མེད་དོ། །
en: Such beings are free from suffering and the notion of suffering.’

source: དེ་ལྟར་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པའི་དགེ་སློང་མང་པོ་དེ་དག་ལ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པའི་དགེ་སློང་དེ་དག་གིས་བཟློག་པར་མ་ནུས་སོ། །
en: “However, the Great Vehicle monks were unable to reverse many of the monks of the Hearer Vehicle.

source: དགེ་སློང་དེ་དག་ལ་མོས་པའི་སྟོབས་མེད་དེ། གང་མོས་པའི་སྟོབས་མེད་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་ཏུ་སྐལ་བ་མེད་དོ། །
en: Because those monks did not possess the power of inspiration, and when someone lacks the power of inspiration, that person lacks the fortune to accomplish unexcelled and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱེད་པར་འདོད་པས་མོས་པའི་སྟོབས་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: Thus, Maudgalyāyana, bodhisattva great beings who are intent on benefiting all sentient beings should endeavor to achieve the power of inspiration.

source: དེའི་ཚེ་དེའི་དུས་ན་མོས་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པའི་དགེ་སློང་ཞིག་བྱུང་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time the monk of the Great Vehicle known as Endowed with the Power of Inspiration was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་མོས་པའི་སྟོབས་དང་ལྡན་པ་ཞེས་བྱ་བ་དགེ་སློང་དུ་གྱུར་ཏོ། །
en: In those days I was the monk Endowed with the Power of Inspiration.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་གནས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནསདགེ་བའི་རྩ་བ་སྣ་ཚོགས་གྲངས་མེད་ཅིང་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the path that leads to cessation as related to knowledge of abiding. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད་གཞལ་གྱིས་མི་ལང་བརྗོད་དུ་མེད་པའི་འཁོར་བ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་བླ་མ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Long ago in the unfathomable, incalculable, inconceivable, immeasurable, and inexpressible cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named Master of Brahmā; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དགེ་སློང་གི་དགེ་འདུན་གྱི་འཁོར་དཔག་ཏུ་མེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དཔག་ཏུ་མེད་དོ། །
en: The saṅgha of monks and the retinue of bodhisattvas around that buddha were beyond measure.

source: དེར་བྱང་ཆུབ་སེམས་དཔའ་རིག་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཅིག་བྱུང་སྟེ། དེས་ཚོར་བ་ཐམས་ཅད་གདུལ་བའི་དོན་དུ་ཚོར་བ་བདག་གི་དོན་རྟོགས་ཏེ།
en: Within the retinue was a bodhisattva by the name of Gatimān, who for the sake of taming all sensations realized the intrinsic nature of sensation.

source: དེ་དེ་ལྔར་རྣམ་པར་ཤེས་ནས་རྫུ་འཕྲུལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་བྱས་སོ། །
en: With that understanding he illumined all of the miraculous realms of the buddhas.

source: གྲོགས་པོ་དག་ཚོར་བ་རྣམས་གདུལ་བའི་དོན་དུ་ཡུན་རིང་པོར་བརྗོད་དུ་མེད་པར་སངས་རྒྱས་ཀྱི་ཞིང་གི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: In order to tame the sensations of his friends, he spent an inexpressibly long time ripening the sentient beings of his buddha realm toward awakening.

source: དེ་དག་གདུལ་བའི་དོན་དུ་རིག་པ་ཞེས་བརྗོད་དེ།
en: To tame them he would say ‘knowledge.’

source: སེམས་ཅན་འདོད་ཆགས་སྤྱོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་འདུལ། །སེམས་ཅན་ཞེ་སྡང་སྤྱོད་པ་རྣམས་ཀྱི་ཞེ་སྡང་འདུལ། སེམས་ཅན་གཏི་མུག་སྤྱོད་པ་རྣམས་གྱི་གཏི་མུག་འདུལ། སེམས་ཅན་ཆ་མཉམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་འདུལ་ལོ། །
en: Thereby desire would be tamed in the sentient beings experiencing desire, anger would be tamed in the sentient beings experiencing anger, stupidity would be tamed in the sentient beings experiencing stupidity, and all afflictions would be tamed in the sentient beings experiencing a mixture of afflictions.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་རིག་པ་དང་ལྡན་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva Gatimān was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་རིག་པ་དང་ལྡན་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Gatimān.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ངས་ཚིག་གིས་བྱང་ཆུབ་ཏུ་འདུལ་ཏེ།
en: Using my speech, I guided the beings of that buddha realm toward awakening,

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་སེམས་ཅན་རྣམས་ཀྱི་དོན་མཛད་ནས་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: and when all those thus-gone ones had benefitted sentient beings they would pass beyond suffering in the realm in which there is no remainder of the aggregates.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་བསྟན་པ་དངོས་པོ་གསུམ་པོ་དང་པོ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། ཞུགས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྣམས་ངས་ཡོངས་སུ་བཟུང་ངོ་། །
en: I upheld the three types of teaching of all those thus-gone ones as they gained perfect awakening, remained, and finally passed beyond suffering.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་ཀྱི་བསྟན་པ་ཡོངས་སུ་གཟུང་བར་བྱ།
en: Maudgalyāyana, bodhisattva great beings must therefore uphold the teachings of the buddhas.

source: གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་གཟུང་བར་བྱའོ། །
en: They must also uphold the knowledge of abiding as related to the path that leads to cessation.

source: མཽད་གལ་གྱི་བུ་དེ་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔས་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བར་འགྱུར་ཏེ། གང་ལམ་ཡོངས་སུ་འཛིན་པ་དེ་ནི་བསྟན་པ་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ། །
en: Upholding that, Maudgalyāyana, the bodhisattvas will be upholding the sacred Dharma, because by taking hold of the path one takes hold of the teachings.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ཡང་དག་པ་མ་ཡིན་པའི་ལམ་ལ་སྡུག་བསྔལ་ཞེས་ཚིག་ཏུ་བརྗོད་ཀྱང་སྡུག་བསྔལ་སོ་སོར་མི་ཤེས།
en: “Immature, childish beings, who lack the true path, may speak of ‘suffering,’ yet they do not understand what suffering is.

source: སྡུག་བསྔལ་གྱི་རྒྱུ་ཚིག་ཏུ་བརྗོད་ཀྱང་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡོངས་སུ་མི་ཤེས།
en: They may talk about ‘the causes of suffering,’ yet they do not recognize those causes.

source: མི་རྟག་པ་ཞེས་ཚིག་ཏུ་བརྗོད་ཀྱང་སྡུག་བསྔལ་འགོག་པ་སོ་སོར་མི་ཤེས།
en: They may speak of ‘impermanence,’ but they do not comprehend the cessation of suffering.

source: སྡུག་བསྔལ་ལས་འབྲོས་ཀྱང་སྡུག་བསྔལ་ལས་ཡོངས་སུ་མ་ཐར་ཏོ། །
en: Even if they run away from suffering, they cannot escape it.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྒྱུ་དང་འབྲས་བུ་ལ་མཁས་པར་བྱའོ། །
en: “Thus, Maudgalyāyana, bodhisattva great beings must become experts about cause and effect.

source: མཽད་གལ་གྱི་བུ་རྒྱུ་དང་འབྲས་བུ་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྒྱུ་འགོག་པའི་ལམ་སྟོན་པར་བྱེད་དོ། །
en: Maudgalyāyana, bodhisattvas who are experts regarding cause and effect will reveal the path that brings an end to causes.

source: སྔོན་གྱི་སྦྱོར་བ་གསུམ་པོ་འདི་དག་ནི་འཇིག་རྟེན་ཤེས་པ་ལ་སྦྱར་བར་བྱའོ། །
en: “These three preceding activities belong to the knowledge of the world.”

source: མཽད་གལ་གྱི་བུ་ངས་འཇིག་རྟེན་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་དུ་མ་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the world.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཡང་དག་པར་ལྡན་པར་བྱས། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་ཡང་དག་པར་ལྡན་པར་བྱས་སོ། །
en: Thus, I made sure to practice the perfections of generosity, discipline, patience, diligence, concentration, and insight.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད། གཞལ་གྱིས་མི་ལང་བའི་འཁོར་བ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེད་དཔོན་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བ་མཛངས་ཤིང་གསལ་ལ་ཡིད་གཞུངས།
en: “Maudgalyāyana, long ago, before unfathomable, incalculable, inconceivable, immeasurable, and inexpressible cycles of existence, long before even the distant past, there was a bold, intelligent, and trustworthy captain by the name of Kāruṇika.

source: ཕྱོགས་དང་ཕྱོགས་མཚམས་ལ་མཁས།
en: The captain was knowledgeable about the cardinal directions as well as the intermediate directions,

source: དོན་དང་དོན་མ་ཡིན་པ་ལ་མཁས།
en: and he was skilled in distinguishing the meaningful from the meaningless.

source: རྒྱུ་སྐར་དང་ཉིན་མོ་ལ་མཁས།
en: He was an expert about the planets and the sun, [the moments and time periods, and the ways to distinguish between the useful and the useless.]

source: སྐད་ཅིག་དང་ཐང་ཅིག་ཡུད་ཙམ་ལ་མཁས།
en: He was an expert about [the planets and the sun,] the moments and time periods[, and the ways to distinguish between the useful and the useless].

source: ཐབས་དང་ཐབས་མ་ཡིན་པ་ལ་མཁས་པ་ཞིག་བྱུང་ངོ་། །
en: He was an expert about [the planets and the sun, the moments and time periods, and] the ways to distinguish between the useful and the useless.

source: དེ་སྡོམ་པ་མནོས་ཤིང་དགེ་མཚན་དང་བཀྲ་ཤིས་དང་ལྡན་པར་བྱས་ནས་ཚོང་པ་ལྔ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ། །
en: “Having received vows and obtained the various marks of virtue and auspiciousness, the captain went to sea together with a group of five hundred merchants.

source: དེ་ཚོང་པ་དེད་དཔོན་གྱི་ཡོངས་སུ་འདྲེན་པ་ཡིན་ཏེ། དེ་ཚོང་པ་དེ་དག་དང་འཇིག་རྟེན་གྱི་གཏམ་སྨྲའོ། །
en: On the way, the captain who was acting as guide for the five hundred merchants spoke to them about the world:

source: འཇིག་རྟེན་གྱི་ཁམས་འདི་ནས་ཤར་ཕྱོགས་ལོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་ན་ལ་ལ་ནི་སྐྱེ། ལ་ལ་ནི་འགག །ལ་ལ་ནི་འཇིག །ལ་ལ་ནི་འབྱུང་། ལ་ལ་ནི་ཞིག་ནས་འདུག །ལ་ལ་ནི་བྱུང་ནས་འདུག་སྟེ།
en: ‘To the east of this world there are innumerable other worlds, some of which are being formed, some of which are ceasing, some of which are disintegrating, and some of which are emerging. Still others remain in a state of post-disintegration, and others remain after being formed.

source: གྲོགས་པོ་དག་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་མཐའ་མེད་དོ། །
en: Friends, such worlds are innumerable .

source: དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སེམས་ཅན་རིགས་ཕུན་སུམ་ཚོགས་པ་དག་ཡོད། སེམས་ཅན་རིགས་དམའ་བ་དག་ཡོད།
en: Likewise, in all these worlds throughout the ten directions, there are beings of superior type and beings of inferior type.

source: སེམས་ཅན་ཁ་ཅིག་ནི་ཕྱུག །ཁ་ཅིག་ནི་དབུལ།
en: Some of them are rich, some poor.

source: སེམས་ཅན་ཁ་ཅིག་ནི་བྲན་བྱེད། ཁ་ཅིག་ནི་ཇོ་བོ་བྱེད་དེ།
en: Some of them are servants, some lords.

source: གྲོགས་པོ་དག་དེ་ལྟ་བས་ན་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་ཤེས་པ་ལ་འབད་པར་བྱའོ། །
en: Friends, you must therefore strive to gain knowledge of both the world and that which is beyond it.’

source: དེའི་ཚེ་དེའི་དུས་ན་དེད་དཔོན་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time Kāruṇika, the captain, was anyone else, do not think so.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་ཤེས་པ་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: Maudgalyāyana, bodhisattvas must thus apply themselves to knowing the world and that which is beyond it.

source: མཽད་གལ་གྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་བསླབ་པར་བྱ་ཞེ་ན།
en: “You may wonder, Maudgalyāyana, how one is to train in knowledge of the origin as related to knowledge of the world.
